{
	"id": "oval:org.opensuse.security:def:202456515",
	"version": "1",
	"class": "vulnerability",
	"metadata": {
		"title": "CVE-2024-56515",
		"affected": {
			"family": "unix",
			"platform": [
				"SUSE Linux Enterprise Module for Package Hub 15 SP6"
			]
		},
		"reference": [
			{
				"ref_id": "Mitre CVE-2024-56515",
				"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-56515",
				"source": "CVE"
			},
			{
				"ref_id": "SUSE CVE-2024-56515",
				"ref_url": "https://www.suse.com/security/cve/CVE-2024-56515",
				"source": "SUSE CVE"
			},
			{
				"ref_id": "SUSE-SU-2025:0297-1",
				"ref_url": "https://lists.suse.com/pipermail/sle-security-updates/2025-January/020248.html",
				"source": "SUSE-SU"
			}
		],
		"description": "\n    Matrix Media Repo (MMR) is a highly configurable multi-homeserver media repository for Matrix. If SVG or JPEGXL thumbnailers are enabled (they are disabled by default), a user may upload a file which claims to be either of these types and request a thumbnail to invoke a different decoder in ImageMagick. In some ImageMagick installations, this includes the capability to run Ghostscript to decode the image/file. If MP4 thumbnailers are enabled (also disabled by default), the same issue as above may occur with the ffmpeg installation instead. MMR uses a number of other decoders for all other file types when preparing thumbnails. Theoretical issues are possible with these decoders, however in testing they were not possible to exploit. This is fixed in MMR v1.3.8. MMR now inspects the mimetype of media prior to thumbnailing, and picks a thumbnailer based on those results instead of relying on user-supplied values. This may lead to fewer thumbnails when obscure file shapes are used. This also helps narrow scope of theoretical issues with all decoders MMR uses for thumbnails. Users are advised to upgrade. Users unable to upgrade may disable the SVG, JPEGXL, and MP4 thumbnail types in the MMR config which prevents the decoders from being invoked. Further disabling uncommon file types on the server is recommended to limit risk surface. Containers and other similar technologies may also be used to limit the impact of vulnerabilities in external decoders, like ImageMagick and ffmpeg. Some installations of ImageMagick may disable \"unsafe\" file types, like PDFs, already. This option can be replicated to other environments as needed. ffmpeg may be compiled with limited decoders/codecs. The Docker image for MMR disables PDFs and similar formats by default.\n    ",
		"advisory": {
			"from": "security@suse.de",
			"severity": "Moderate",
			"cve": [
				{
					"text": "CVE-2024-56515 at SUSE",
					"href": "https://www.suse.com/security/cve/CVE-2024-56515/"
				},
				{
					"text": "CVE-2024-56515 at NVD",
					"href": "https://nvd.nist.gov/vuln/detail/CVE-2024-56515"
				}
			],
			"issued": {
				"date": "2025-02-03"
			},
			"updated": {
				"date": "2025-02-03"
			},
			"affected_cpe_list": {
				"cpe": [
					"cpe:/o:suse:packagehub:15:sp6"
				]
			}
		}
	},
	"criteria": {
		"operator": "AND",
		"criterions": [
			{
				"test_ref": "oval:org.opensuse.security:tst:2009856293",
				"comment": "SUSE Linux Enterprise Module for Package Hub 15 SP6 is installed"
			},
			{
				"test_ref": "oval:org.opensuse.security:tst:2009962134",
				"comment": "govulncheck-vulndb-0.0.20250128T150132-150000.1.29.1 is installed"
			}
		]
	}
}
