{
	"id": "oval:org.opensuse.security:def:202524784",
	"version": "1",
	"class": "vulnerability",
	"metadata": {
		"title": "CVE-2025-24784",
		"affected": {
			"family": "unix",
			"platform": [
				"openSUSE Tumbleweed"
			]
		},
		"reference": [
			{
				"ref_id": "Mitre CVE-2025-24784",
				"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-24784",
				"source": "CVE"
			},
			{
				"ref_id": "SUSE CVE-2025-24784",
				"ref_url": "https://www.suse.com/security/cve/CVE-2025-24784",
				"source": "SUSE CVE"
			},
			{
				"ref_id": "SUSE-SU-2025:0429-1",
				"ref_url": "https://lists.suse.com/pipermail/sle-security-updates/2025-February/020315.html",
				"source": "SUSE-SU"
			}
		],
		"description": "\n    kubewarden-controller is a Kubernetes controller that allows you to dynamically register Kubewarden admission policies. The policy group feature, added to by the 1.17.0 release. By being namespaced, the AdmissionPolicyGroup has a well constrained impact on cluster resources. Hence, it's considered safe to allow non-admin users to create and manage these resources in the namespaces they own. Kubewarden policies can be allowed to query the Kubernetes API at evaluation time; these types of policies are called \"context aware\". Context aware policies can perform list and get operations against a Kubernetes cluster. The queries are done using the ServiceAccount of the Policy Server instance that hosts the policy. That means that access to the cluster is determined by the RBAC rules that apply to that ServiceAccount. The AdmissionPolicyGroup CRD allowed the deployment of context aware policies. This could allow an attacker to obtain information about resources that are out of their reach, by leveraging a higher access to the cluster granted to the ServiceAccount token used to run the policy. The impact of this vulnerability depends on the privileges that have been granted to the ServiceAccount used to run the Policy Server and assumes that users are using the recommended best practices of keeping the Policy Server's ServiceAccount least privileged. By default, the Kubewarden helm chart grants access to the following resources (cluster wide) only: Namespace, Pod, Deployment and Ingress. This vulnerability is fixed in 1.21.0.\n    ",
		"advisory": {
			"from": "security@suse.de",
			"severity": "Moderate",
			"cve": [
				{
					"text": "CVE-2025-24784 at SUSE",
					"href": "https://www.suse.com/security/cve/CVE-2025-24784/"
				},
				{
					"text": "CVE-2025-24784 at NVD",
					"href": "https://nvd.nist.gov/vuln/detail/CVE-2025-24784"
				}
			],
			"issued": {
				"date": "2025-02-10"
			},
			"updated": {
				"date": "2025-02-12"
			},
			"affected_cpe_list": {
				"cpe": [
					"cpe:/o:opensuse:tumbleweed"
				]
			}
		}
	},
	"criteria": {
		"operator": "AND",
		"criterions": [
			{
				"test_ref": "oval:org.opensuse.security:tst:2009634834",
				"comment": "openSUSE Tumbleweed is installed"
			},
			{
				"test_ref": "oval:org.opensuse.security:tst:2009962991",
				"comment": "govulncheck-vulndb-0.0.20250204T220613-1.1 is installed"
			}
		]
	}
}
