{
	"id": "oval:org.opensuse.security:def:202140444",
	"version": "1",
	"class": "vulnerability",
	"metadata": {
		"Title": "CVE-2021-40444",
		"affected": {
			"family": "unix",
			"Platform": [
				"openSUSE Tumbleweed"
			]
		},
		"reference": [
			{
				"ref_id": "Mitre CVE-2021-40444",
				"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-40444",
				"source": "CVE"
			},
			{
				"ref_id": "SUSE CVE-2021-40444",
				"ref_url": "https://www.suse.com/security/cve/CVE-2021-40444",
				"source": "SUSE CVE"
			}
		],
		"Description": "\n    <p>Microsoft is investigating reports of a remote code execution vulnerability in MSHTML that affects Microsoft Windows. Microsoft is aware of targeted attacks that attempt to exploit this vulnerability by using specially-crafted Microsoft Office documents.</p>\n<p>An attacker could craft a malicious ActiveX control to be used by a Microsoft Office document that hosts the browser rendering engine. The attacker would then have to convince the user to open the malicious document. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights.</p>\n<p>Microsoft Defender Antivirus and Microsoft Defender for Endpoint both provide detection and protections for the known vulnerability. Customers should keep antimalware products up to date. Customers who utilize automatic updates do not need to take additional action. Enterprise customers who manage updates should select the detection build 1.349.22.0 or newer and deploy it across their environments. Microsoft Defender for Endpoint alerts will be displayed as: “Suspicious Cpl File Execution”.</p>\n<p>Upon completion of this investigation, Microsoft will take the appropriate action to help protect our customers. This may include providing a security update through our monthly release process or providing an out-of-cycle security update, depending on customer needs.</p>\n<p>Please see the <strong>Mitigations</strong> and <strong>Workaround</strong> sections for important information about steps you can take to protect your system from this vulnerability.</p>\n<p><strong>UPDATE</strong> September 14, 2021: Microsoft has released security updates to address this vulnerability. Please see the Security Updates table for the applicable update for your system. We recommend that you install these updates immediately. Please see the FAQ for important information about which updates are applicable to your system.</p>\n\n    ",
		"advisory": {
			"from": "security@suse.de",
			"Severity": "Important",
			"cve": {
				"text": "CVE-2021-40444 at NVD",
				"href": "https://nvd.nist.gov/vuln/detail/CVE-2021-40444",
				"impact": "important",
				"cvss3": "7.8/CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H"
			},
			"issued": {
				"date": "2024-02-12"
			},
			"updated": {
				"date": "2024-04-18"
			},
			"affected_cpe_list": {
				"Cpe": [
					"cpe:/o:opensuse:tumbleweed"
				]
			}
		}
	},
	"criteria": {
		"operator": "AND",
		"criterias": [
			{
				"operator": "OR",
				"criterions": [
					{
						"test_ref": "oval:org.opensuse.security:tst:2009846254",
						"comment": "python310-oletools-0.60.1-1.1 is installed"
					},
					{
						"test_ref": "oval:org.opensuse.security:tst:2009846255",
						"comment": "python311-oletools-0.60.1-1.1 is installed"
					},
					{
						"test_ref": "oval:org.opensuse.security:tst:2009846256",
						"comment": "python312-oletools-0.60.1-1.1 is installed"
					},
					{
						"test_ref": "oval:org.opensuse.security:tst:2009846257",
						"comment": "python39-oletools-0.60.1-1.1 is installed"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:org.opensuse.security:tst:2009634834",
				"comment": "openSUSE Tumbleweed is installed"
			}
		]
	}
}
